cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>HEMC_CR_NCS3</name>
               <description>HEMC Control Register NCS 3</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>fixed to 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BANKSIZE</name>
                     <description>Bank Size</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>BANKSIZESelect</name>
                        <enumeratedValue>
                           <name>_8KB</name>
                           <description>8Kbytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16KB</name>
                           <description>16Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32KB</name>
                           <description>32Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64KB</name>
                           <description>64Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128KB</name>
                           <description>128Kbytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256KB</name>
                           <description>256Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512KB</name>
                           <description>512Kbytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1MB</name>
                           <description>1Mbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2MB</name>
                           <description>2Mbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4MB</name>
                           <description>4Mbytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8MB</name>
                           <description>8Mbytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16MB</name>
                           <description>16Mbytes</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32MB</name>
                           <description>32Mbytes</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64MB</name>
                           <description>64Mbytes</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128MB</name>
                           <description>128Mbytes</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256MB</name>
                           <description>256Mbytes (Default)</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512MB</name>
                           <description>512Mbytes</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <description>NOT_USED</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>type of memory used</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDBASE</name>
                     <description>relative base address of NCS area</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>ECC_ENABLE</name>
                     <description>ECC Protection Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CR_NCS4</name>
               <description>HEMC Control Register NCS 4</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>fixed to 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BANKSIZE</name>
                     <description>Bank Size</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>BANKSIZESelect</name>
                        <enumeratedValue>
                           <name>_8KB</name>
                           <description>8Kbytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16KB</name>
                           <description>16Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32KB</name>
                           <description>32Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64KB</name>
                           <description>64Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128KB</name>
                           <description>128Kbytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256KB</name>
                           <description>256Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512KB</name>
                           <description>512Kbytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1MB</name>
                           <description>1Mbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2MB</name>
                           <description>2Mbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4MB</name>
                           <description>4Mbytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8MB</name>
                           <description>8Mbytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16MB</name>
                           <description>16Mbytes</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32MB</name>
                           <description>32Mbytes</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64MB</name>
                           <description>64Mbytes</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128MB</name>
                           <description>128Mbytes</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256MB</name>
                           <description>256Mbytes (Default)</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512MB</name>
                           <description>512Mbytes</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <description>NOT_USED</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>type of memory used</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDBASE</name>
                     <description>relative base address of NCS area</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>ECC_ENABLE</name>
                     <description>ECC Protection Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CR_NCS5</name>
               <description>HEMC Control Register NCS 5</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>fixed to 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BANKSIZE</name>
                     <description>Bank Size</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>BANKSIZESelect</name>
                        <enumeratedValue>
                           <name>_8KB</name>
                           <description>8Kbytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16KB</name>
                           <description>16Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32KB</name>
                           <description>32Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64KB</name>
                           <description>64Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128KB</name>
                           <description>128Kbytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256KB</name>
                           <description>256Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512KB</name>
                           <description>512Kbytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1MB</name>
                           <description>1Mbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2MB</name>
                           <description>2Mbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4MB</name>
                           <description>4Mbytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8MB</name>
                           <description>8Mbytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16MB</name>
                           <description>16Mbytes</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32MB</name>
                           <description>32Mbytes</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64MB</name>
                           <description>64Mbytes</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128MB</name>
                           <description>128Mbytes</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256MB</name>
                           <description>256Mbytes (Default)</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512MB</name>
                           <description>512Mbytes</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <description>NOT_USED</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>type of memory used</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDBASE</name>
                     <description>relative base address of NCS area</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>ECC_ENABLE</name>
                     <description>ECC Protection Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CTRL</name>
               <description>HEMC Polarity Control register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>POL</name>
                     <description>External control buffer active polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CRP_NCS0</name>
               <description>HEMC Control Register Protection NCS 0</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CRP_NCS1</name>
               <description>HEMC Control Register Protection NCS 1</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
