cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>HEMC_CRP_NCS2</name>
               <description>HEMC Control Register Protection NCS 2</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CRP_NCS3</name>
               <description>HEMC Control Register Protection NCS 3</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CRP_NCS4</name>
               <description>HEMC Control Register Protection NCS 4</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_CRP_NCS5</name>
               <description>HEMC Control Register Protection NCS 5</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_IER</name>
               <description>HEMC Interrupt Enable Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>user or superuser access error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_IDR</name>
               <description>HEMC Interrupt Disable Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>user or superuser access error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_IMR</name>
               <description>HEMC Interrupt Mask Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>user or superuser access error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_ISR</name>
               <description>HEMC Interrupt Status Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>Write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>User or SuperUser Error Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_SR</name>
               <description>HEMC Status Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>Read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>Write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>User or SuperUser Error Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR0</name>
               <description>HECC Control Register Channel 0 (HSMC)</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR1</name>
               <description>HECC Control Register Channel 1 (HSDRAMC)</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR2</name>
               <description>HECC Control Register Channel 2 (HSDRAMC)</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB0</name>
               <description>HECC Test mode Register Channel 0 (HSMC)</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB1</name>
               <description>HECC Test mode Register Channel 1 (HSDRAMC)</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB2</name>
               <description>HECC Test mode Register Channel 2 (HSDRAMC)</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
