cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>IP1553_RXBSR</name>
               <description>Rx Buffer Status Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RE0</name>
                     <description>Receive Buffer, 0 with x=[0-31]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE1</name>
                     <description>Receive Buffer, 1 with x=[0-31]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE2</name>
                     <description>Receive Buffer, 2 with x=[0-31]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE3</name>
                     <description>Receive Buffer, 3 with x=[0-31]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE4</name>
                     <description>Receive Buffer, 4 with x=[0-31]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE5</name>
                     <description>Receive Buffer, 5 with x=[0-31]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE6</name>
                     <description>Receive Buffer, 6 with x=[0-31]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE7</name>
                     <description>Receive Buffer, 7 with x=[0-31]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE8</name>
                     <description>Receive Buffer, 8 with x=[0-31]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE9</name>
                     <description>Receive Buffer, 9 with x=[0-31]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE10</name>
                     <description>Receive Buffer, 10 with x=[0-31]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE11</name>
                     <description>Receive Buffer, 11 with x=[0-31]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE12</name>
                     <description>Receive Buffer, 12 with x=[0-31]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE13</name>
                     <description>Receive Buffer, 13 with x=[0-31]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE14</name>
                     <description>Receive Buffer, 14 with x=[0-31]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE15</name>
                     <description>Receive Buffer, 15 with x=[0-31]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE16</name>
                     <description>Receive Buffer, 16 with x=[0-31]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE17</name>
                     <description>Receive Buffer, 17 with x=[0-31]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE18</name>
                     <description>Receive Buffer, 18 with x=[0-31]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE19</name>
                     <description>Receive Buffer, 19 with x=[0-31]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE20</name>
                     <description>Receive Buffer, 20 with x=[0-31]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE21</name>
                     <description>Receive Buffer, 21 with x=[0-31]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE22</name>
                     <description>Receive Buffer, 22 with x=[0-31]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE23</name>
                     <description>Receive Buffer, 23 with x=[0-31]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE24</name>
                     <description>Receive Buffer, 24 with x=[0-31]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE25</name>
                     <description>Receive Buffer, 25 with x=[0-31]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE26</name>
                     <description>Receive Buffer, 26 with x=[0-31]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE27</name>
                     <description>Receive Buffer, 27 with x=[0-31]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE28</name>
                     <description>Receive Buffer, 28 with x=[0-31]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE29</name>
                     <description>Receive Buffer, 29 with x=[0-31]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE30</name>
                     <description>Receive Buffer, 30 with x=[0-31]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE31</name>
                     <description>Receive Buffer, 31 with x=[0-31]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IP1553_RXBAER</name>
               <description>Rx Buffer Access Error Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RER0</name>
                     <description>Receive error 0, x with x=[0-31]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER1</name>
                     <description>Receive error 1, x with x=[0-31]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER2</name>
                     <description>Receive error 2, x with x=[0-31]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER3</name>
                     <description>Receive error 3, x with x=[0-31]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER4</name>
                     <description>Receive error 4, x with x=[0-31]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER5</name>
                     <description>Receive error 5, x with x=[0-31]</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER6</name>
                     <description>Receive error 6, x with x=[0-31]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER7</name>
                     <description>Receive error 7, x with x=[0-31]</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER8</name>
                     <description>Receive error 8, x with x=[0-31]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER9</name>
                     <description>Receive error 9, x with x=[0-31]</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER10</name>
                     <description>Receive error 10, x with x=[0-31]</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER11</name>
                     <description>Receive error 11, x with x=[0-31]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER12</name>
                     <description>Receive error 12, x with x=[0-31]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER13</name>
                     <description>Receive error 13, x with x=[0-31]</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER14</name>
                     <description>Receive error 14, x with x=[0-31]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER15</name>
                     <description>Receive error 15, x with x=[0-31]</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER16</name>
                     <description>Receive error 16, x with x=[0-31]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER17</name>
                     <description>Receive error 17, x with x=[0-31]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER18</name>
                     <description>Receive error 18, x with x=[0-31]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER19</name>
                     <description>Receive error 19, x with x=[0-31]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER20</name>
                     <description>Receive error 20, x with x=[0-31]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER21</name>
                     <description>Receive error 21, x with x=[0-31]</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER22</name>
                     <description>Receive error 22, x with x=[0-31]</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER23</name>
                     <description>Receive error 23, x with x=[0-31]</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER24</name>
                     <description>Receive error 24, x with x=[0-31]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER25</name>
                     <description>Receive error 25, x with x=[0-31]</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER26</name>
                     <description>Receive error 26, x with x=[0-31]</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER27</name>
                     <description>Receive error 27, x with x=[0-31]</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER28</name>
                     <description>Receive error 28, x with x=[0-31]</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER29</name>
                     <description>Receive error 29, x with x=[0-31]</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER30</name>
                     <description>Receive error 30, x with x=[0-31]</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RER31</name>
                     <description>Receive error 31, x with x=[0-31]</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
