cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>MATRIX_PRBS14</name>
               <description>Priority Register B for Slave 14</description>
               <addressOffset>0x00F4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M8PR</name>
                     <description>Master 8 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN8</name>
                     <description>Latency Quality of Service Enable for Master 8</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M9PR</name>
                     <description>Master 9 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN9</name>
                     <description>Latency Quality of Service Enable for Master 9</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M10PR</name>
                     <description>Master 10 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN10</name>
                     <description>Latency Quality of Service Enable for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M11PR</name>
                     <description>Master 11 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN11</name>
                     <description>Latency Quality of Service Enable for Master 11</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M12PR</name>
                     <description>Master 12 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN12</name>
                     <description>Latency Quality of Service Enable for Master 12</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M13PR</name>
                     <description>Master 13 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN13</name>
                     <description>Latency Quality of Service Enable for Master 13</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M14PR</name>
                     <description>Master 14 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN14</name>
                     <description>Latency Quality of Service Enable for Master 14</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M15PR</name>
                     <description>Master 15 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN15</name>
                     <description>Latency Quality of Service Enable for Master 15</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRAS15</name>
               <description>Priority Register A for Slave 15</description>
               <addressOffset>0x00F8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN0</name>
                     <description>Latency Quality of Service Enable for Master 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN1</name>
                     <description>Latency Quality of Service Enable for Master 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN2</name>
                     <description>Latency Quality of Service Enable for Master 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN3</name>
                     <description>Latency Quality of Service Enable for Master 3</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M4PR</name>
                     <description>Master 4 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN4</name>
                     <description>Latency Quality of Service Enable for Master 4</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M5PR</name>
                     <description>Master 5 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN5</name>
                     <description>Latency Quality of Service Enable for Master 5</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M6PR</name>
                     <description>Master 6 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN6</name>
                     <description>Latency Quality of Service Enable for Master 6</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M7PR</name>
                     <description>Master 7 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN7</name>
                     <description>Latency Quality of Service Enable for Master 7</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRBS15</name>
               <description>Priority Register B for Slave 15</description>
               <addressOffset>0x00FC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M8PR</name>
                     <description>Master 8 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN8</name>
                     <description>Latency Quality of Service Enable for Master 8</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M9PR</name>
                     <description>Master 9 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN9</name>
                     <description>Latency Quality of Service Enable for Master 9</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M10PR</name>
                     <description>Master 10 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN10</name>
                     <description>Latency Quality of Service Enable for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M11PR</name>
                     <description>Master 11 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN11</name>
                     <description>Latency Quality of Service Enable for Master 11</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M12PR</name>
                     <description>Master 12 Priority</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN12</name>
                     <description>Latency Quality of Service Enable for Master 12</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M13PR</name>
                     <description>Master 13 Priority</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN13</name>
                     <description>Latency Quality of Service Enable for Master 13</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M14PR</name>
                     <description>Master 14 Priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN14</name>
                     <description>Latency Quality of Service Enable for Master 14</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M15PR</name>
                     <description>Master 15 Priority</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LQOSEN15</name>
                     <description>Latency Quality of Service Enable for Master 15</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MRCR</name>
               <description>Master Remap Control Register</description>
               <addressOffset>0x0100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RCB0</name>
                     <description>Remap Command Bit for Master 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB1</name>
                     <description>Remap Command Bit for Master 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB2</name>
                     <description>Remap Command Bit for Master 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB3</name>
                     <description>Remap Command Bit for Master 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB4</name>
                     <description>Remap Command Bit for Master 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB5</name>
                     <description>Remap Command Bit for Master 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB6</name>
                     <description>Remap Command Bit for Master 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB7</name>
                     <description>Remap Command Bit for Master 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB8</name>
                     <description>Remap Command Bit for Master 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB9</name>
                     <description>Remap Command Bit for Master 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB10</name>
                     <description>Remap Command Bit for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB11</name>
                     <description>Remap Command Bit for Master 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB12</name>
                     <description>Remap Command Bit for Master 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB13</name>
                     <description>Remap Command Bit for Master 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB14</name>
                     <description>Remap Command Bit for Master 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB15</name>
                     <description>Remap Command Bit for Master 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR0</name>
               <description>Special Function Register 0</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR1</name>
               <description>Special Function Register 1</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR2</name>
               <description>Special Function Register 2</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR3</name>
               <description>Special Function Register 3</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR4</name>
               <description>Special Function Register 4</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR5</name>
               <description>Special Function Register 5</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR6</name>
               <description>Special Function Register 6</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR7</name>
               <description>Special Function Register 7</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR8</name>
               <description>Special Function Register 8</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_SFR9</name>
               <description>Special Function Register 9</description>
               <addressOffset>0x134</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
