cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>MATRIX_MEAR5</name>
               <description>Master 0 Error Address Register 5</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR6</name>
               <description>Master 0 Error Address Register 6</description>
               <addressOffset>0x178</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR7</name>
               <description>Master 0 Error Address Register 7</description>
               <addressOffset>0x17C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR8</name>
               <description>Master 0 Error Address Register 8</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR9</name>
               <description>Master 0 Error Address Register 9</description>
               <addressOffset>0x184</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR10</name>
               <description>Master 0 Error Address Register 10</description>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR11</name>
               <description>Master 0 Error Address Register 11</description>
               <addressOffset>0x18C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR12</name>
               <description>Master 0 Error Address Register 12</description>
               <addressOffset>0x190</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR13</name>
               <description>Master 0 Error Address Register 13</description>
               <addressOffset>0x194</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR14</name>
               <description>Master 0 Error Address Register 14</description>
               <addressOffset>0x198</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_MEAR15</name>
               <description>Master 0 Error Address Register 15</description>
               <addressOffset>0x19C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRADD</name>
                     <description>Master Error Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_WPMR</name>
               <description>Write Protect Mode Register</description>
               <addressOffset>0x01E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGFRZ</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0.</description>
                           <value>0x4D4154</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_WPSR</name>
               <description>Write Protect Status Register</description>
               <addressOffset>0x01E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PSR0</name>
               <description>Protection Slave 0 Register 0</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LAUSERH0</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH1</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH2</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH3</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH4</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH5</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH6</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH7</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH0</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH1</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH2</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH3</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH4</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH5</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH6</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH7</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH0</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH1</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH2</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH3</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH4</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH5</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH6</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH7</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA0</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA1</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA2</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA3</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA4</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA5</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA6</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA7</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
