cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>SPW_PKTTX1_NXTSENDROUT</name>
               <description>PktTx Next Send List Router Bytes</description>
               <addressOffset>0xC24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BYTE4</name>
                     <description>Byte4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE3</name>
                     <description>Byte3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>Byte2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE1</name>
                     <description>Byte1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_PKTTX1_NXTSENDADDR</name>
               <description>PktTx Next Send List Address</description>
               <addressOffset>0xC28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_PKTTX1_NXTSENDCFG</name>
               <description>PktTx Next Send List Config</description>
               <addressOffset>0xC2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>Start Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start Mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>STARTEVENT</name>
                           <description>Start if any bit in Start Value matches an incoming event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTNOW</name>
                           <description>Start immediately, if possible</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTTCH1</name>
                           <description>Start if Start Value matches an incoming Time Code from Time Code Handler 1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>Abort</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_PKTTX1_CURSENDROUT</name>
               <description>PktTx Current Send List Router Bytes</description>
               <addressOffset>0xC30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BYTE4</name>
                     <description>Byte4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE3</name>
                     <description>Byte3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>Byte2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE1</name>
                     <description>Byte1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_PKTTX1_CURSENDADDR</name>
               <description>PktTx Current Send List Address</description>
               <addressOffset>0xC34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_PKTTX1_CURSENDCFG</name>
               <description>PktTx Current Send List Config</description>
               <addressOffset>0xC38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>Abort</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_PKTTX1_SWRESET</name>
               <description>PktTx Software Reset</description>
               <addressOffset>0xC3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATTERN</name>
                     <description>Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_RMAP1_CFG</name>
               <description>SpW RMAP 1 Config</description>
               <addressOffset>0x00000E00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DESTKEY</name>
                     <description>DestKey</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TLA</name>
                     <description>Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RMAPENA</name>
                     <description>RMAP Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_RMAP1_STS_RC</name>
               <description>SpW RMAP 1 Read and Clear Status</description>
               <addressOffset>0x00000E04</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRCODE</name>
                     <description>Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ERRCODESelect</name>
                        <enumeratedValue>
                           <name>NOERROR</name>
                           <description>No error detected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAERROR</name>
                           <description>Error while DMA accessing the internal bus, e.g. illegal address.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RMAPERROR</name>
                           <description>Unused RMAP command according to [RMAP]</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DESTKEYERROR</name>
                           <description>Destination key error</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATACRCERROR</name>
                           <description>Data CRC error</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOPERROR</name>
                           <description>Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CARGOERROR</name>
                           <description>Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEPERROR</name>
                           <description>Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMDERROR</name>
                           <description>Authorisation error:Invalid or unsupported command.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TLAERROR</name>
                           <description>Non-matching Target Logical Address.</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HEADERCRCERROR</name>
                           <description>Incorrect header CRC.</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROTOCOLIDERROR</name>
                           <description>Protocol Identifier not supported.</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPLYADDERROR</name>
                           <description>Unsupported reply address length</description>
                           <value>0x12</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>Valid</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_RMAP1_STS</name>
               <description>SpW RMAP 1 Read Status</description>
               <addressOffset>0x00000E08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRCODE</name>
                     <description>Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ERRCODESelect</name>
                        <enumeratedValue>
                           <name>NOERROR</name>
                           <description>No error detected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAERROR</name>
                           <description>Error while DMA accessing the internal bus, e.g. illegal address.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RMAPERROR</name>
                           <description>Unused RMAP command according to [RMAP]</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DESTKEYERROR</name>
                           <description>Destination key error</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATACRCERROR</name>
                           <description>Data CRC error</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOPERROR</name>
                           <description>Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CARGOERROR</name>
                           <description>Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEPERROR</name>
                           <description>Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMDERROR</name>
                           <description>Authorisation error:Invalid or unsupported command.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TLAERROR</name>
                           <description>Non-matching Target Logical Address.</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HEADERCRCERROR</name>
                           <description>Incorrect header CRC.</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROTOCOLIDERROR</name>
                           <description>Protocol Identifier not supported.</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPLYADDERROR</name>
                           <description>Unsupported reply address length</description>
                           <value>0x12</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>Valid</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_RM</name>
               <description>SpW Tch Pending Read Masked Interrupt</description>
               <addressOffset>0x00000E80</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_RCM</name>
               <description>SpW Tch Pending Read and Clear Masked Interrupt</description>
               <addressOffset>0x00000E84</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_R</name>
               <description>SpW Tch Pending Read Interrupt</description>
               <addressOffset>0x00000E88</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
