cmsis-svd/cmsis-svd/data/Microchip/ATSAMRH71F.svd
            <register>
               <name>SPW_TCH_PI_RCS</name>
               <description>SpW Tch Pending Read, Clear and Enabled Interrupt</description>
               <addressOffset>0x00000E8C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_IM</name>
               <description>SpW Tch Interrupt Mask</description>
               <addressOffset>0x00000E90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_C</name>
               <description>SpW Tch Clear Pending Interrupt</description>
               <addressOffset>0x00000E94</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_IM_S</name>
               <description>SpW Tch Interrupt Set Mask</description>
               <addressOffset>0x00000E98</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_IM_C</name>
               <description>SpW Tch Interrupt Clear Mask</description>
               <addressOffset>0x00000E9C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGLISTEN</name>
               <description>SpW Tch Config Listener</description>
               <addressOffset>0x00000EA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>L1</name>
                     <description>Listen  link 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>L2</name>
                     <description>Listen link 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGSEND</name>
               <description>SpW Tch Config Sender</description>
               <addressOffset>0x00000EA4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>S1</name>
                     <description>Send link 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S2</name>
                     <description>Send link 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFG</name>
               <description>SpW Tch Config</description>
               <addressOffset>0x00000EA8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EVENT</name>
                     <description>Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGRESTART</name>
               <description>SpW Tch Config Restart</description>
               <addressOffset>0x00000EAC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>EVENT</name>
                     <description>Event</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PPS</name>
                     <description>Pps</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONESHOT</name>
                     <description>One Shot</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGTCEVENT</name>
               <description>SpW Tch Config Tc Event</description>
               <addressOffset>0x00000EB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGWD</name>
               <description>SpW Tch Config Watchdog</description>
               <addressOffset>0x00000EB4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LATE</name>
                     <description>Late</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>EARLY</name>
                     <description>Early</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_LASTTIMECODE</name>
               <description>SpW Tch Last Time Code</description>
               <addressOffset>0x00000EB8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SEND</name>
                     <description>Send Now</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_SWRESET</name>
               <description>SpW Tch Software Reset</description>
               <addressOffset>0x00000EBC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATTERN</name>
                     <description>Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_GROUP_IRQSTS1</name>
               <description>SpW Group Interrupt status 1</description>
               <addressOffset>0x00000F00</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TX1</name>
                     <description>Tx 1</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX1</name>
                     <description>Rx 1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCH</name>
                     <description>Time Code Handler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_GROUP_IRQSTS2</name>
               <description>SpW Group Interrupt status 2</description>
               <addressOffset>0x00000F04</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>Link2</name>
                     <description>Link 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Dia2</name>
                     <description>Distributed Interrupt Acknowledge, Link 2</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Di2</name>
                     <description>Distributed Interrupt 2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Link1</name>
                     <description>Link 1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Dia1</name>
                     <description>Distributed Interrupt Acknowledge, Link 1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Di1</name>
                     <description>Distributed Interrupt 1</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_GROUP_EDACSTS</name>
               <description>SpW Group Interrupt status</description>
               <addressOffset>0x00000F08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CORR</name>
                     <description>Correction Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>UNCORR</name>
                     <description>Uncorrectable Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
